app/Http/Controllers/MainController.php

select * from `slider` where `status` = '1' order by `slider`.`id` desc
select * from `news` order by `date` desc, `id` desc limit 12
select * from `news` where `type` = 'blog' order by `date` desc, `id` desc limit 6
select * from `testimonial` order by `testimonial`.`id` desc
select * from `gallery` where `type` = 'News' order by `gallery`.`id` desc limit 6
select * from `gallery` where `type` = 'Donate' order by `gallery`.`id` desc limit 6
---
	public function index()
	{
	    $allslider=DB::table('slider')->where('status', 1)->orderBy('slider.id','DESC')->get();

		// For Homepage Recent Work: show both events and blogs
		$allevent=Db::table('news')->orderBy('date','DESC')->orderBy('id','DESC')->limit(12)->get();

		// Featured stories on homepage: show only blogs
		$allblog=Db::table('news')->where('type', 'blog')->orderBy('date','DESC')->orderBy('id','DESC')->limit(6)->get();

		$alltestimonial=Db::table('testimonial')->orderBy('testimonial.id','DESC')->get();

		$allactivity=Db::table('gallery')->where('type','Activity')->orderBy('gallery.id','DESC')->limit(6)->get();
		$allcampains=Db::table('gallery')->where('type','Campains')->orderBy('gallery.id','DESC')->limit(6)->get();
		$allnews=Db::table('gallery')->where('type','News')->orderBy('gallery.id','DESC')->limit(6)->get();
		$alldonate=Db::table('gallery')->where('type','Donate')->orderBy('gallery.id','DESC')->limit(6)->get();

select * from `testimonial` where `type` = 'Advisory' order by `testimonial`.`id` asc
---
	public function ourteam()
	{
		$alltestimonial=Db::table('testimonial')->orderBy('testimonial.id','ASC')->get();

select * from `news` order by `date` desc, `id` desc
---
	public function event()
	{
		// Our Work page: show BOTH events and blogs
		$allevent=Db::table('news')->orderBy('date','DESC')->orderBy('id','DESC')->get();

select * from `gallery` where `type` = 'Video' order by `gallery`.`id` desc
select * from `gallery` where `type` = 'Activity' order by `gallery`.`id` desc
---
	public function gallery()
	{
		$photos=Db::table('gallery')->where('type', 'Photo')->orderBy('gallery.id','DESC')->get();
		$videos=Db::table('gallery')->where('type', 'Video')->orderBy('gallery.id','DESC')->get();

select * from `blog` order by `blog`.`id` desc
---
	public function blog()
	{
		$allblog=Db::table('blog')->orderBy('blog.id','DESC')->get();

select * from `blog` where `slug` = 'skill-development-economic-independence' limit 1
---
	public function singleblog($slug)
	{
		$thisblog=Db::table('blog')->where('slug',$slug)->first();

select * from `news` where `id` = '11' limit 1
---
	public function singlework($id)
	{
		$thiswork=Db::table('news')->where('id',$id)->first();