app/Http/Controllers/ServiceController.php

select * from `news` order by `date` desc
---
	public function viewnews(Request $request)
	{
		$filter = $request->get('filter');
		$today = date('Y-m-d');

		$query = DB::table('news');

		if ($filter == 'previous') {
			$query->where('date', '<', $today);
		} elseif ($filter == 'upcoming') {
			$query->where('date', '>=', $today);
		}

		$allnews = $query->orderBy('date','DESC')->get();

select * from `blog` order by `id` desc
---
	public function viewblog()
	{
		$allblog = DB::table('blog')->orderBy('id','DESC')->get();

select * from `gallery` order by `id` desc
---
	public function viewgallery()
	{
		$allgallery = DB::table('gallery')->orderBy('id','DESC')->get();

select * from `testimonial` order by `id` desc
---
	public function viewtestimonial()
	{
		$alltestimonial = DB::table('testimonial')->orderBy('id', 'DESC')->get();

select * from `slider` order by `id` desc
---
	public function viewslider()
	{
		$allslider = DB::table('slider')->orderBy('id', 'DESC')->get();

select * from `strategy` order by `id` desc
---
	public function viewstrategy()
	{
		$allstrategy = DB::table('strategy')->orderby('id','DESC')->get();

select * from `strategy` where `id` = '3' limit 1
---
	public function editstrategy($id, Request $request)
	{
		$thisdata = DB::table('strategy')->where('id', $id)->first();

update `strategy` set `name` = 'Leadership', `description` = 'Creating the next generation of fearless feminist leadership.', `image` = 'leadership.jpeg' where `id` = '3'
---
				}
			}

			DB::table('strategy')->where('id', $id)->update($input);

select * from `education_cards` order by `id` desc
select * from `gallery` where `type` in ('Donate', 'Activity') order by `id` desc
---
	public function vieweducation()
	{
		$alleducation = DB::table('education_cards')->orderby('id','DESC')->get();
		$allgallery = DB::table('gallery')->whereIn('type', ['Donate', 'Activity'])->orderby('id','DESC')->get();