app/Http/Controllers/ServiceController.php

		public function viewnews()
	{
		$allnews=DB::table('news')->orderBy('news.id','DESC')->get();
---
select * from `news` order by `news`.`id` desc

	public function viewslider()
	{
		$allslider=DB::table('slider')->orderBy('slider.id','DESC')->get();
---
select * from `slider` order by `slider`.`id` desc

	public function viewgallery()
	{
		$allgallery=DB::table('gallery')->orderBy('gallery.id','DESC')->get();
---
select * from `gallery` order by `gallery`.`id` desc

	public function editgallery($id,Request $request)
	{
		date_default_timezone_set('Asia/Kolkata');
		$id = unserialize(base64_decode($id));
		$thisdata = DB::table('gallery')->where('id',$id)->first();
---
select * from `gallery` where `id` = '6' limit 1